const craftData = {
    "box_4": { 
        name: "Ящик (Containers_DK4_Level_4)", 
        image: "img/box_4.png", 
        materials: { "Доски": 1, "Отвертка": 1, "Набор инструментов": 1, "Металлические пластины": 2, "Проволока": 2, "Журнал тех. разработок 2": 1 } 
    },
    "mosin": { 
        name: "Винтовка Мосин 91/30", 
        image: "img/mosin.png", 
        materials: { "Металлические пластины": 2, "Оружейное масло": 1, "Изолента": 1, "Отвертка": 1, "Кусачки": 1, "Проволока": 2 } 
    },
    "journal_2": { 
        name: "Журнал тех. разработок №2", 
        image: "img/journal_2.png", 
        materials: { "Журнал тех. разработок 1": 1, "Микросхема": 1, "Клей": 1, "Кожа": 1 } 
    },
    "journal_3": { 
        name: "Журнал тех. разработок №3", 
        image: "img/journal_3.png", 
        materials: { "Журнал тех. разработок 2": 1, "Микросхема": 1, "Клей": 1, "Синяя ткань": 1, "Кожа": 1 } 
    },
    "sr25": { 
        name: "Снайперская винтовка SR-25", 
        image: "img/sr25.png", 
        materials: { "Медный слиток": 5, "Металлический брусок": 5, "WD40 400мл": 3, "Набор для калибровки Мастер": 4, "Фазированная решетка РЛС": 4, "Накопитель VFX": 5, "Кусок резины": 4, "Контейнер оружие синий": 5, "Журнал технических разработок 5": 1, "Шеврон техника": 1 } 
    },
    "fine_tools": { 
        name: "Набор для тонкой работы", 
        image: "img/fine_tools.png", 
        materials: { "Доски": 1, "Проволока": 1, "Изолента": 1, "Кусачки": 1, "Ткань": 1, "Журнал тех. разработок 2": 1 } 
    },
    "pszd": { 
        name: "Комплект ПСЗД (Свобода)", 
        image: "img/pszd.png", 
        materials: { "Ткань": 1, "Бронеплита": 4, "Металлические пластины": 4, "Набор инструментов": 4, "Листовой металл": 3, "Противогазный фильтр": 2, "Аптечка Salewa": 1, "Журнал тех. разработок 1": 1 } 
    },
    "ak105": { 
        name: "АК-105 Булл-пап", 
        image: "img/ak105.png", 
        materials: { "Проволока": 2, "Кусачки": 1, "Отвертка": 1, "Изолента": 1, "Металлические пластины": 2, "Набор для тонкой работы": 1, "Журнал тех. разработок 1": 1 } 
    }
};
